In [2]:
gd_car_train = 'https://drive.google.com/file/d/1NI7dTxmekoaLR-4GHbmhSEw5_BDgq1S3/view?usp=sharing'
cartrain = 'https://drive.google.com/uc?export=download&id='+gd_car_train.split('/')[-2]

In [3]:
import numpy as np
import pandas as pd
import re

In [4]:
df = pd.read_csv(cartrain)
df.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [5]:
dict = {
    "name":['harry','rohan','skillf','shubh'],
    "marks":[92,34,24,17],
    "city":['rampur','kolkata','bareilly','antartica']
}

In [6]:
df1=pd.DataFrame(dict)
df1.head()

     name  marks       city
0   harry     92     rampur
1   rohan     34    kolkata
2  skillf     24   bareilly
3   shubh     17  antartica

In [7]:
nameage = '''
Janice is 22 and Theon is 33
Gabriel is 44 and Joey is 21
'''

ages = re.findall(r'\d{1,3}',nameage)
names = re.findall(r'[A-Z][a-z]*',nameage)

agedict = {}

x = 0

for eachname in names:
    agedict[eachname] = ages[x]
    x+=1
    
print(agedict)

{'Janice': '22', 'Theon': '33', 'Gabriel': '44', 'Joey': '21'}

In [12]:
# Find word in a string
allinform = re.findall("inform","we need to inform him with the latest information")

if re.search("inform","we need to inform him with the latest information"):
    print("Found")

for i in allinform:
    print (i)

Found
inform
inform

In [18]:
# Match Pattern
str = "Sat, hat, mat, pat"
allstr = re.findall("[Shmp]at",str)
allstr1 = re.findall("[\D]at",str) 
allstr2 = re.findall("[^S]at",str)

for i in allstr:
    print(i)

for i in allstr1:
    print(i)

for i in allstr2:
    print(i)

Sat
hat
mat
pat
Sat
hat
mat
pat
hat
mat
pat

In [35]:
# Replace

food = "hat rat mat pat"
# regex = re.compile("[r]at")
food = re.sub("rat","food",food)
print(food)

hat food mat pat

In [29]:
randstr = "here is \\drogba"
print(randstr)
print(re.search(r"\\drogba",randstr))

here is \drogba
<_sre.SRE_Match object; span=(8, 15), match='\\drogba'>

In [34]:
# Find one specific character
randstr = '''
Keep the blue flag
flying high
chelsea
'''
print(randstr)

# regex = re.compile("\n")
randstr = re.sub("\n"," ",randstr)
print(randstr)

Keep the blue flag
flying high
chelsea

 Keep the blue flag flying high chelsea

In [37]:
randstr="12345"
print("Matches:", len(re.findall("\d{5}",randstr)))

Matches: 1

In [39]:
# Phone number validation

phone = "412-555-1212"

if re.search("\w{3}-\w{3}-\w{4}", phone):
    print("it is a phone number")

it is a phone number

In [47]:
# Verify email address
x = "256.50 ABC"
y = re.sub("[^0-9.]","",x)
print(y)

256.50

In [48]:
x = "256.50 ABC"
y = re.sub("/(\.\d+)+/","",x)
print(y)

256.50 ABC

In [4]:
import re
x = "256.50 ABC"
regex = re.compile("[^0-9.]")
y = regex.sub("",x)
print(y)

256.50